{
  "sku": "604599575",
  "gtin": "190199312425",
  "name": "Beats Solo3 Wireless Headphones - Black",
  "image": "https://i5.walmartimages.com/seo/Beats-Solo3-Wireless-Headphones-Black_f76ac660-9f5a-495c-9af3-4bec619de77a_1.cf2fbfe5d7071433a3c80a2360a3d7f4.png",
  "description": "Beats Solo3 Wireless Headphones - Black",
  "model": "MX432LL/A",
  "brand": "Beats by Dr. Dre",
  "ratingValue": 4.5941,
  "bestRating": 5,
  "reviewCount": 7229,
  "url": "/ip/Beats-Solo3-Wireless-Headphones-Black/604599575",
  "priceCurrency": "USD",
  "price": 119,
  "availability": "IN_STOCK",
  "itemCondition": "New",
  "reviews": [
    {
      "title": "Finally got the Beats!!!",
      "datePublished": "12/31/2020",
      "reviewBody": "Awesome sound quality, the build is solid, and the price is right...no pun intended!!! \nLoL\nWhen connecting the headphones with your device, it's VERY quick and syncs easily. Battery life is really good, but the only downside...Apple didn't include a Charging Brick!!! The Cable is in the package, but NO Brick!",
      "reviewRating": 5,
      "author": "DEIDRE"
    },
    {
      "datePublished": "7/12/2024",
      "reviewBody": "I disliked the way the delivery person had just set the package down knocked on the door and ran off but other than that the beats are amazing and play good as well.",
      "reviewRating": 5,
      "author": "Azucena"
    },
    {
      "title": "I love my beats",
      "datePublished": "12/18/2023",
      "reviewBody": "The sound is so clear and you can hear it as loud as you want. I love the way the cushion is so soft on the ears. The headset is very comfortable. I'm very happy with my purchase, especially with the price I paid and I didn't have to charge it every day. Lol",
      "reviewRating": 5,
      "author": "jeannette"
    },
    {
      "title": "Quality same as airpods.",
      "datePublished": "11/25/2022",
      "reviewBody": "Got this during Black Friday deals 2022 for $89. Picked up at the Gurnee Store. Box was completely sealed. Everything was intacked. Sounds great! Its the same\nquality as an airpods. Reason for getting it was its on a great price. So happy with the purchased.",
      "reviewRating": 5,
      "author": "Russell"
    },
    {
      "title": "Amazing!",
      "datePublished": "12/30/2023",
      "reviewBody": "These headphones were a gift to my 14 year old daughter. I had no idea how much she would love them, until she took them out of the box. The controls are on the headphones. She can call out to another phone with them and talk. They are small and soft on her ears. It blocks out noise and the music is clear.  It also has a case so she can easily store them and travel with them. I have to say it is impressive. I am so glad we bought them.",
      "reviewRating": 5,
      "author": "JH"
    },
    {
      "title": "Amazing Sound but Achy Ears",
      "datePublished": "11/27/2022",
      "reviewBody": "Amazing sound quality and good bass! (I was skeptical at first but these are the official Beats by Dre.) The rose gold color is sleek and nice. The size is a bit smaller than I expected but still great. Only reason why I didn't give it 5 stars is because of the ear cover area: after about 10 minutes of listening to music (at an average volume, not too loud) the ear cushion area starts to push pressure on the outer parts of the ears and cause a serious ache. Other than that, the headphobes are a great buy.",
      "reviewRating": 4,
      "author": "China"
    },
    {
      "title": "Headphone not working",
      "datePublished": "4/26/2024",
      "reviewBody": "I brought the headphone in December and it's just April and the headphone is not even working no more and I cannot even exchange it so I like to know what can I do because I did spend some money on that and my daughter needed it for school so what can I do?",
      "reviewRating": 3,
      "author": "Jackie"
    },
    {
      "title": "Sumptuously Brief",
      "datePublished": "12/29/2023",
      "reviewBody": "I had my heart set on these for some time. I noticed the sale and splurged on myself to get them. I followed the setup instructions. I charged and connected them. I was only able to use them briefly within a 24 hour span. They quit charging, turning on, and I got nowhere with trying to connect with a tech specialist on their website to troubleshoot the issue. Walmart was amazing in response to their 30-day return policy. I got my money back on a gift card to go towards my next order. Instead I was gifted a pair of Sony Headphones for Xmas. A brief plug for them. They are 1000% times better than the Beats in every way!!From ear comfort/coverage, to sound quality, battery life, and tech specs. I highly recommend checking out the Sony WH-1000XM4. Granted they are more in price and definitely worth every penny!!!",
      "reviewRating": 1,
      "author": "Maygan"
    },
    {
      "datePublished": "7/13/2024",
      "reviewBody": "literally received broken headphones i was already upset because they wouldn't deliver my package because it required a signature and was not able to sign because i was at work every time they tried to deliver it and then i finally figured out how to be able to have it held somewhere so i can pick it up and when i open it the headphone are broken in half i should have known because the box was damaged also but never ordering anything like this from walmart again",
      "reviewRating": 1,
      "author": "Camille"
    },
    {
      "datePublished": "6/12/2024",
      "reviewBody": "Beats stopped working after 2 months They say their bot charge but i charge them and they just won't work They won't connect to my phone anymore either",
      "reviewRating": 1,
      "author": "Kimora"
    }
  ]
}
